package com.company.hw2;
/*
Дано значение числа pi, которое равно 3,141592653 и значение числа Эйлера е, которое равно
        2,7182818284590452. Создайте две переменные, присвойте им значения числа pi и числа е и выведите
        их на экран без потери точности.
*/

public class HW_2 {
    public static void main(String[] args) {
        final double PI = 3.141592653;
        final double E = 2.7182818284590452;
        System.out.println("PI = " + PI);
        System.out.println("E = " + E);
    }
}
