package com.company.hw2;

/*
      Используя IntelliJ IDEA, создайте проект.
    Создайте три строковые переменные и присвойте им значения:
    "\nмоя строка 1"
    "\tмоя строка 2"
    "\aмоя строка 3"
    Выведите значение каждой переменной на экран. Какие отличия вы видели. Сделайте выводы.
*/

public class HW_3 {
    public static void main(String[] args) {
        String myString1 = "\nмоя строка 1";
        String myString2 = "\tмоя строка 2";
//        String myString3 = "\aмоя строка 3";
        System.out.println("myString1 = " + myString1);
        System.out.println("myString2 = " + myString2);
//        System.out.println("myString3 = " + myString3);
    }
}
